docs/research-topics/coded-caching.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coded Caching</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-orgf23260e" class="outline-2">
<h2 id="orgf23260e">Introduction</h2>
<div class="outline-text-2" id="text-orgf23260e">
<p>
The coded caching problem was introduced by M. A. Maddah-Ali and U. Niesen, in &ldquo;Fundamental limits of caching,&rdquo; 2013 IEEE International Symposium on Information Theory, 2013, pp. 1077-1081, doi: 10.1109/ISIT.2013.6620392. This problem consists of a server connected through a shared, error-free link to \(K\) users. The server stores \(N\) files \(W_1 , \cdots W_N\) each of size \(F\) bits. User \(k , \forall k \in [K]\) has an isolated cache memory \(Z_k\) of size \(MF\) bits for some real number \(M \in [0:N]\).
</p>

<p>
The system operates in two phases.
</p>
<ol class="org-ol">
<li><b>Placement Phase</b>: This phase corresponds to the off-peak hours, when the network traffic is low. In this phase, the users cache are filled from some arbitrary functions of the files.</li>
<li><b>Delivery Phase</b>: In this phase, user \(k , \forall k \in [K]\) request a file \(W_{d_k}\) from the server. Every user request a file independently. After receiving the users&rsquo; requests, the server proceeds by transmitting a signal of size \(RF\) bits over the shared link. Using the content \(Z_k\) of its cache and the signal received over the shared link, each user \(k\) aims to reconstruct its requested file \(W_{d_k}\).</li>
</ol>
</div>

<div id="outline-container-org47dc7b3" class="outline-3">
<h3 id="org47dc7b3">Multi-access Coded caching</h3>
<div class="outline-text-3" id="text-org47dc7b3">
<p>
In multi-access coded caching setup, users don&rsquo;t have access to dedicated caches. There are \(C\) cache nodes and each user can access \(L \leq C\) cache nodes. In placement phase, these cache nodes are filled with some arbitrary function of the files. Then in delivery phase, users request their desired files from the server. Server performs coded transmissions of size \(RF\) bits and users should be able to decode their desired files from these transmissions and the content stored in the caches they are accessing.
</p>
</div>
</div>
</div>

<div id="outline-container-orga1db96d" class="outline-2">
<h2 id="orga1db96d">Our Contribution</h2>
<div class="outline-text-2" id="text-orga1db96d">
<p>
We considered the problem of cache-aided . In this setup, there are \(B\) non-colluding servers storing \(N\) files. We propose a Private Information Retrieval scheme in which \(K\) users aided with \(C\) Multi-Access cache nodes privately retrieve data from distributed servers. We considered several multi-access setups with multiple non-colluding servers with all the messages replicated across the servers. Each server is connected to all the users via error-free broadcast links.
</p>
</div>

<div id="outline-container-orga6d6d64" class="outline-3">
<h3 id="orga6d6d64">Publications</h3>
<div class="outline-text-3" id="text-orga6d6d64">
<ul class="org-ul">
<li>Kanishak Vaidya and B. Sundar Rajan, ``Cache-Aided Multi-Access Multi-User Private Information Retrieval,&rsquo;&rsquo; in Wi-Opt CCDWN 2022, Turin, Italy, 19 &#x2013; 23 September 2022.</li>
<li>Kanishak Vaidya and B. Sundar Rajan, ``Multi-Access Cache-Aided Multi-User Private Information Retrieval,&rsquo;&rsquo; arXiv:2201.11481, 9 Feb 2022.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
